100ms time frame 
index=main  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip) | bin _time span=100ms |eval H=len(_raw)| stats count as W(H) mean(H) stdev(H) BY _time src_ip | join src_ip [search index=main  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip) | bin _time span=100ms | eval M=len(_raw)| stats count as W(M) mean(M) stdev(M) BY _time src_ip eth_src] | join src_ip [search index=*  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip) | bin _time span=100ms | eval HH=len(_raw) | stats count as W(HH) mean(HH) stdev(HH) BY _time src_ip dst_ip] | join src_ip [search index=*  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip)| transaction src_ip dst_ip maxevents=2 | bin _time span=100ms | eval HH_jit=len(_raw)  | stats count as W(HH_jit) mean(HH_jit) stdev(HH_jit) BY _time src_ip dst_ip] | join src_ip [search index=*  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip) | bin _time span=100ms | eval HpHp=len(_raw) | stats count as W(HpHp) mean(HpHp) stdev(HpHp) BY _time src_ip src_port dst_ip dst_port] | table _time W(H) mean(H) stdev(H) W(M) mean(M) stdev(M) W(HH) mean(HH) stdev(HH) W(HH_jit) mean(HH_jit) stdev(HH_jit) W(HpHp) mean(HpHp) stdev(HpHp) magnitud(HpHp) radius(HpHp) covariance(HpHp) correlation(HpHp)

500ms time frame 
index=main  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip) | bin _time span=500ms |eval H=len(_raw)| stats count as W(H) mean(H) stdev(H) BY _time src_ip | join src_ip [search index=main  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip) | bin _time span=500ms | eval M=len(_raw)| stats count as W(M) mean(M) stdev(M) BY _time src_ip eth_src] | join src_ip [search index=*  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip) | bin _time span=500ms | eval HH=len(_raw) | stats count as W(HH) mean(HH) stdev(HH) BY _time src_ip dst_ip] | join src_ip [search index=*  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip)| transaction src_ip dst_ip maxevents=2 | bin _time span=500ms | eval HH_jit=len(_raw)  | stats count as W(HH_jit) mean(HH_jit) stdev(HH_jit) BY _time src_ip dst_ip] | join src_ip [search index=*  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip) | bin _time span=500ms | eval HpHp=len(_raw) | stats count as W(HpHp) mean(HpHp) stdev(HpHp) BY _time src_ip src_port dst_ip dst_port] | table _time W(H) mean(H) stdev(H) W(M) mean(M) stdev(M) W(HH) mean(HH) stdev(HH) W(HH_jit) mean(HH_jit) stdev(HH_jit) W(HpHp) mean(HpHp) stdev(HpHp) magnitud(HpHp) radius(HpHp) covariance(HpHp) correlation(HpHp)

1s time frame 
index=main  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip) | bin _time span=1s |eval H=len(_raw)| stats count as W(H) mean(H) stdev(H) BY _time src_ip | join src_ip [search index=main  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip) | bin _time span=1s | eval M=len(_raw)| stats count as W(M) mean(M) stdev(M) BY _time src_ip eth_src] | join src_ip [search index=*  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip) | bin _time span=1s | eval HH=len(_raw) | stats count as W(HH) mean(HH) stdev(HH) BY _time src_ip dst_ip] | join src_ip [search index=*  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip)| transaction src_ip dst_ip maxevents=2 | bin _time span=1s | eval HH_jit=len(_raw)  | stats count as W(HH_jit) mean(HH_jit) stdev(HH_jit) BY _time src_ip dst_ip] | join src_ip [search index=*  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip) | bin _time span=1s | eval HpHp=len(_raw) | stats count as W(HpHp) mean(HpHp) stdev(HpHp) BY _time src_ip src_port dst_ip dst_port] | table _time W(H) mean(H) stdev(H) W(M) mean(M) stdev(M) W(HH) mean(HH) stdev(HH) W(HH_jit) mean(HH_jit) stdev(HH_jit) W(HpHp) mean(HpHp) stdev(HpHp) magnitud(HpHp) radius(HpHp) covariance(HpHp) correlation(HpHp)

10s time frame 
index=main  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip) | bin _time span=10s |eval H=len(_raw)| stats count as W(H) mean(H) stdev(H) BY _time src_ip | join src_ip [search index=main  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip) | bin _time span=10s | eval M=len(_raw)| stats count as W(M) mean(M) stdev(M) BY _time src_ip eth_src] | join src_ip [search index=*  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip) | bin _time span=10s | eval HH=len(_raw) | stats count as W(HH) mean(HH) stdev(HH) BY _time src_ip dst_ip] | join src_ip [search index=*  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip)| transaction src_ip dst_ip maxevents=2 | bin _time span=10s | eval HH_jit=len(_raw)  | stats count as W(HH_jit) mean(HH_jit) stdev(HH_jit) BY _time src_ip dst_ip] | join src_ip [search index=*  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip) | bin _time span=10s | eval HpHp=len(_raw) | stats count as W(HpHp) mean(HpHp) stdev(HpHp) BY _time src_ip src_port dst_ip dst_port] | table _time W(H) mean(H) stdev(H) W(M) mean(M) stdev(M) W(HH) mean(HH) stdev(HH) W(HH_jit) mean(HH_jit) stdev(HH_jit) W(HpHp) mean(HpHp) stdev(HpHp) magnitud(HpHp) radius(HpHp) covariance(HpHp) correlation(HpHp)

1m time frame 
index=main  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip) | bin _time span=1m |eval H=len(_raw)| stats count as W(H) mean(H) stdev(H) BY _time src_ip | join src_ip [search index=main  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip) | bin _time span=1m | eval M=len(_raw)| stats count as W(M) mean(M) stdev(M) BY _time src_ip eth_src] | join src_ip [search index=*  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip) | bin _time span=1m | eval HH=len(_raw) | stats count as W(HH) mean(HH) stdev(HH) BY _time src_ip dst_ip] | join src_ip [search index=*  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip)| transaction src_ip dst_ip maxevents=2 | bin _time span=1m | eval HH_jit=len(_raw)  | stats count as W(HH_jit) mean(HH_jit) stdev(HH_jit) BY _time src_ip dst_ip] | join src_ip [search index=*  dst_port!=23 src_port!=23 dst_ip!="192.168.10.61" | where NOT cidrmatch("192.168.10.1285", src_ip) AND NOT cidrmatch("192.168.10.1285", dst_ip) | bin _time span=1m | eval HpHp=len(_raw) | stats count as W(HpHp) mean(HpHp) stdev(HpHp) BY _time src_ip src_port dst_ip dst_port] | table _time W(H) mean(H) stdev(H) W(M) mean(M) stdev(M) W(HH) mean(HH) stdev(HH) W(HH_jit) mean(HH_jit) stdev(HH_jit) W(HpHp) mean(HpHp) stdev(HpHp) magnitud(HpHp) radius(HpHp) covariance(HpHp) correlation(HpHp)
